import { Title } from 'components';

export function AboutUs() {
  return (
    <>
      <Title>ПРО НАС</Title>
      <p>
        Ми доставляємо товар транспортними службами по Україні (Нова Пошта,
        Делівері, САТ, Інтайм, Міст Експрес). Доставка транспортними службами
        відбувається за рахунок покупця. Зверніть, будь ласка, увагу:
        замовлення, зроблені після 11:00, відправляються на наступний день.
        Оплатити замовлення Ви можете такими способами: Privat24 – з Вами
        зв’яжеться наш менеджер та уточнить деталі платежу Накладений платіж –
        відправка товарів проводиться тільки після передоплати 5% від вартості
        замовлення, оплата здійснюється у відділенні перевізника при одержанні
        замовлення і оплачується клієнтом додатково: Нова пошта – 20 грн і 2 %
        від суми повернених коштів; Інтайм – 15 грн і 2 % від суми повернених
        коштів; Міст Експрес – 2 % від суми повернених коштів, але не менше 15
        грн; САТ - 1,5 % від суми повернених коштів; Делівері – 10 грн і 1,5%
        від суми повернених коштів, перелік відділень, на яких діє послуга,
        можна перевірити за посиланням. Розрахунковий рахунок для фізичних та
        юридичних осіб. Просимо деталі уточнювати з менеджером. Доставка
        кур’єром по Львову щовівторка та щочетверга. ДОСТАВКА по Львову при
        замовленні та оплаті через інтернет-магазин на суму від 2000 грн.
        безкоштовно. Мінімальне замовлення 700 грн., вартість доставки від
        700-2000 складає 150 грн., при замовленні від 2000 грн - доставка
        безкоштовно у ПН-ПТ. Ви також можете самостійно забрати придбаний товар
        в нашому офісі за адресою м. Львів, вул. Зелена, 301, попередньо
        уточнивши у менеджера наявність товарів на складі. ПОРЯДОК ПОВЕРНЕННЯ
        ТОВАРУ НАЛЕЖНОЇ ЯКОСТІ Повернення товару проводиться згідно чинного
        законодавства України. Повернення товару проводиться за рахунок Покупця.
        Детальніше про умови повернення, ви можете дізнатись з договору оферти,
        розміщеному на нашому сайті. Якщо у Вас виникнуть запитання стосовно
        відправлення чи одержання Вашого замовлення, Ви можете зателефонувати за
        номерами, вказаними на сайті.
      </p>
    </>
  );
}
