import { CloseDeleteBtn, ModalTitle, ModalWrapper } from 'components';

export function ModalConditions({ closeModal }) {
  // const onSubmit = data => {
  //   console.log(data);
  // closeModal();
  // };

  // closeModal();

  return (
    <ModalWrapper closeModal={closeModal} conditions={true}>
      <ModalTitle style={{ marginBottom: 20 }}>Публічний договір</ModalTitle>
      <p>
        Публічний договір - сукупність цивільно-правових норм, що регулюють
        договірні правовідносини, які виникають у сфері підприємницької
        діяльності, де є економічна нерівність сторін, що вимагає встановлення
        додаткових правових гарантій для більш слабкої сторони - споживача.
        Загальною нормою, що містить основні положення про публічний договір, є
        ст. 633 ЦК України. Також діють спеціальні норми, які регулюють
        конкретні види публічних договорів. Спеціальні закони та підзаконні
        акти, прийняті для розвитку норм щодо публічного договору, здійснюють
        детальне регулювання найважливіших положень для деяких договорів.
        Законодавець виокремлює публічний договір з-поміж інших як такий,
        специфічною рисою якого є обов'язок його сторони (а нею завжди є
        підприємець) здійснювати продаж товарів, виконання робіт або надання
        послуг кожному, хто до неї звернеться. Як правило, публічними є
        договори, що укладаються при купівлі-продажу в роздрібній торгівлі, при
        перевезенні транспортом загального користування, наданні послуг зв'язку,
        медичного, готельного, банківського обслуговування тощо (ч. І ст. 633 ЦК
        України). Відмінною рисою цих договорів є те, що підприємець не тільки
        зобов'язаний, здійснюючи свою діяльність, укладати відповідні договори з
        всіма і з кожним, хто до нього звернеться, а й умови цих договорів мають
        бути однаковими для всіх споживачів, крім тих, кому за законом надані
        відповідні пільги (наприклад, при укладенні договорів перевезення певні
        пасажири мають пільги по оплаті проїзду). Підприємець не наділяється
        правом ані надавати переваги одному споживачу перед іншим (частини 2 та
        3 ст. 633 ЦК України), ані відмовлятися від укладення договору за
        наявності в нього такої можливості (ч. 4 ст. 633 ЦК України). Необхідно
        відмітити, що ст.633 ЦК України дає примірний перелік видів економічної
        діяльності, а звідси і договорів, на які поширюється режим публічного
        договору. Визнаються публічними всі договори, що підпадають під дію
        Закону України «Про захист прав споживачів», ст. 19 якого визнає за
        всіма особами рівною мірою право «на задоволення їх потреб у сфері
        торгових і інших видів обслуговування». При цьому не допускається
        встановлення будь-яких переваг, прямих чи непрямих обмежень прав
        споживачів. Споживачеві надається також право на вільний вибір товарів і
        послуг, а на продавця (суб’єкта підприємницької діяльності, що виконує
        роботу чи надає послуги) покладається обов’язок усілякого сприяння
        споживачеві у вільному виборі товарів і послуг (предмета договору).
        Тобто, споживач повинен безпосередньо в силу загону вправі вимагати у
        відповідного суб’єкта підприємницької діяльності укладення договору для
        задоволення побутових потреб, якщо цей суб’єкт неправомірно ухиляється
        від його укладення. З аналізу змісту названого Закону випливає, що його
        дія поширюється на всі відносини по виконанню робіт, наданню послуг,
        продажу товарів особам для їх власних побутових потреб, а укладені з
        цією метою договори є публічні.
      </p>
      <CloseDeleteBtn handleClick={closeModal} />
    </ModalWrapper>
  );
}
